/// <summary>
/// Перечисление, определяющее возможные расположения дверей в комнате.
/// </summary>
public enum DoorDirection
{
    /// <summary>
    /// Дверь, расположенная в верхней части комнаты.
    /// </summary>
    Up = 0,

    /// <summary>
    /// Дверь, расположенная слева в комнате.
    /// </summary>
    Left = 1,

    /// <summary>
    /// Дверь, расположенная справа в комнате.
    /// </summary>
    Right = 2,

    /// <summary>
    /// Дверь, расположенная в нижней части комнаты.
    /// </summary>
    Down = 3
}